[
   {
      "title":"Intro to Web Apps",
      "week":"Week 1",
      "prev":"/student",
      "nextWeek":"/student/w27462:2",
      "ideTitle":"Problem Description 1",
      "ideText":"Using the language C1, code a program to find the first 7 numbers in the fibonacci sequence",
      "test":{
         "code":"This is the code the student should have typed in",
         "output":"This is the expected output"
      },
      "modules":{
         "1":{
            "0":"What is HTML?",
            "image1":"../images/htmlmeme.jpg",
            "text1":"Hypertext Markup Language (HTML) is the standard markup language for documents designed to be displayed in a web browser. It can be assisted by technologies such as Cascading Style Sheets(CSS) and scripting languages such as JavaScript. Web browsers receive HTML documents from a web server or from local storage and render the documents into multimedia web pages. HTML describes the structure of a web page semantically and originally included cues for the appearance of the document. HTML elements are the building blocks of HTML pages. With HTML constructs, images and other objects such as interactive forms may be embedded into the rendered page. HTML provides a means to create structured documents by denoting structural semantics for text such as headings, paragraphs, lists, links, quotes and other items. HTML elements are delineated by tags, written using angle brackets.  <br> <br>  Tags such as img and input directly introduce content into the page. Other tags such as surround and provide information about document text and may include other tags as sub-elements. Browsers do not display the HTML tags, but use them to interpret the content of the page. HTML can embed programs written in a scripting language such as JavaScript, which affects the behavior and content of web pages. Inclusion of CSS defines the look and layout of content. The World Wide Web Consortium (W3C), former maintainer of the HTML and current maintainer of the CSS standards, has encouraged the use of CSS over explicit presentational HTML since 1997",
            "video1":"https://www.youtube.com/embed/dD2EISBDjWM"
         },
         "2":{
            "0":"What is CSS?",
            "text1":"Cascading Style Sheets (CSS) is a style sheet language used for describing the presentatiion of a document written in a markup language like HTML.  <br> <br>  [1] CSS is a cornerstone technology of the World Wide Web, alongside HTML and JavaScript.  <br> <br> [2] CSS is designed to enable the separation of presentation and content, including layout, colors, and fonts.  <br> <br>  [3] This separation can improve content accessibility, provide more flexibility and control in the specification of presentation characteristics, enable multiple web pages to share formatting by specifying the relevant CSS in a separate .css file, and reduce complexity and repetition in the structural content. Separation of formatting and content also makes it feasible to present the same markup page in different styles for different rendering methods, such as on-screen, in print, by voice (via speech-based browser or screen reader), and on Braille-based tactile devices. CSS also has rules for alternate formatting if the content is accessed on a mobile device.  <br> <br>  [4] The name cascading comes from the specified priority scheme to determine which style rule applies if more than one rule matches a particular element. This cascading priority scheme is predictable. The CSS specifications are maintained by the World Wide Web Consortium (W3C). Internet media type (MIME type) text/css is registered for use with CSS by RFC 2318 (March 1998). The W3C operates a free CSS validation service for CSS documents.  <br> <br>  [5]In addition to HTML, other markup languages support the use of CSS including XHTML, plain XML, SVG, and XUL."
         },
         "3":{
            "0":"Bootstrap",
            "text1":"Bootstrap is a free and open-source CSS framework directed at responsive, mobile-first front-end web development. It contains CSS- and (optionally) JavaScript-based design templates for typography, forms, buttons, navigation, and other interface components. Bootstrap is the sixth-most-starred project on GitHub, with more than 135,000 stars, behind freeCodeCamp (almost 307,000 stars)and marginally behind Vue.js framework. According to Alexa Rank, Bootstrap is in the top-2000 in US while vuejs.org is in top-7000 in US.",
            "text2":"Major rewrite of the code.  <br> <br>  Replacing Less with Sass  <br> <br>  Addition of Reboot, a collection of element-specific CSS changes in a single file, based on Normalize  <br> <br>  Dropping support for IE8, IE9, and iOS 6  <br> <br>  CSS Flexible Box support  <br> <br>  Adding navigation customization options  <br> <br>  Adding responsive spacing and sizing utilities  <br> <br>  Switching from the pixels unit in CSS to root ems  <br> <br>  Increasing global font size from 14px to 16px  <br> <br>  Dropping the panel, thumbnail, pager, and well components  <br> <br>  Dropping the Glyphicons icon font  <br> <br>  Huge number[quantify] of utility classes  <br> <br>  Improved form styling, buttons, drop-down menus, media objects and image classes",
            "text3":"This concludes Week 1!"
         },
         "4":{
            "0":"Assignment 1",
            "text1":"Now that you are ready, try this coding assignment to test your expertise on Week 1.",
            "assignment":"/ide/w27462:1"
         }
      }
   },
   {
      "title":"Intro to Web Apps",
      "week":"Week 2",
      "prev":"/student/w27462:1",
      "nextWeek":"/student/w27462:3",
      "modules":{
         "1":{
            "0":"Onto JavaScript!",
            "text1":"Onto Javascript..",
            "image1":"../images/tree.jpg",
            "video1":"https://www.youtube.com/embed/_4-MmsLKRDw"
         },
         "2":{
            "0":"JavaScript",
            "text1":"JavaScript often abbreviated as JS, is a programming language that conforms to the ECMAScript specification.[7] JavaScript is high-level, often just-in-time compiled, and multi-paradigm. It has curly-bracket syntax, dynamic typing, prototype-based object-orientation, and first-class functions. Alongside HTML and CSS, JavaScript is one of the core technologies of the World Wide Web.[8] JavaScript enables interactive web pages and is an essential part of web applications. The vast majority of websites use it for client-side page behavior,[9] and all major web browsers have a dedicated JavaScript engine to execute it As a multi-paradigm language, JavaScript supports event-driven, functional, and imperative programming styles. It has application programming interfaces (APIs) for working with text, dates, regular expressions, standard data structures, and the Document Object Model (DOM). However, the language itself does not include any input/output (I/O), such as networking, storage, or graphics facilities, as the host environment (usually a web browser) provides those APIs. JavaScript engines were originally used only in web browsers, but they are now embedded in some servers, usually via Node.js. They are also embedded in a variety of applications created with frameworks such as Electron and Cordova. Although there are similarities between JavaScript and Java,including language name, syntax, and respective standard libraries, the two languages are distinct and differ greatly in design.",
            "video1":"https://www.youtube.com/embed/W6NZfCO5SIk",
            "video2":"https://www.youtube.com/embed/W6NZfCO5SIk"
         },
         "3":{
            "0":"Node.js",
            "text1":"Some content lies here",
            "text2":"some text",
            "text3":"more text"
         },
         "4":{
            "0":"Assignment 2",
            "text1":"Now that you are ready, try this coding assignment to test your expertise on Week 1.",
            "assignment":"/ide/w27462:2"
         }
      }
   },
   {
      "title":"Intro to Web Apps",
      "week":"Week 3",
      "prev":"/student/w27462:2",
      "nextWeek":"/rankCourse/w27462",
      "modules":{
         "1":{
            "0":"React",
            "text1":"Some content lies here",
            "text2":"some image",
            "text3":"some video"
         },
         "2":{
            "0":"External Libraries",
            "text1":"Here's more content",
            "text2":"some video",
            "text3":"some video"
         },
         "3":{
            "0":"Connections",
            "text1":"And even more content",
            "text2":"some text",
            "text3":"more text"
         },
         "4":{
            "0":"Assignment 3",
            "text1":"Now that you are ready, try this coding assignment to test your expertise on Week 1.",
            "assignment":"/ide/w27462:3"
         }
      }
   }
]
